Repository: xglomba/webte-zaverecne-zadanie
Catalog: app/locale/*/LC_MESSAGES/django.po
Languages: sk

source: English
sk: Angličtina

source: Slovak
sk: Slovenčina

source: first_name
sk: Meno

source: last_name
sk: Priezvisko

source: name
sk: Názov

source: file
sk: Súbor

source: images
sk: Obrázky

source: points
sk: Body

source: allowed_from
sk: Aktívne od

source: allowed_to
sk: Aktívne do

source: batch
sk: Sada

source: batchs
sk: Sady

source: task
sk: Úloha

source: solution
sk: Riešenie

source: image
sk: Obrázok

source: tasks
sk: Úlohy

source: task_submission
sk: Pridelená úloha

source: tasks_submissions
sk: Pridelené úlohy

source: Export to CSV
sk: Exportovať do CSV

source: WEBTE FINAL ASSIGNMENT
sk: WEBTE ZAVERECNE ZADANIE

source: Student
sk: Študent

source: Home
sk: Domov

source: Manual
sk: Návod

source: Logout
sk: Odhlásenie

source: Username
sk: Používateľské meno

source: Password
sk: Heslo

source: Login
sk: Prihlásenie

source: Application is now running on the address 0.0.0.0:8000, we enter the 127.0.0.1:8000 into the browser.
sk: Aplikácia odteraz beží na adrese 0.0.0.0:8000, do vyhľadávača zadáme adresu 127.0.0.1:8000.

source: How to create teacher
sk: Návod na vytvorenie učiteľa

source: Follow the steps in the console.
sk: Pokračujeme podľa pokynov v aplikácií.

source: Credentials are now stored in the SQLite3 database.
sk: Zadané údaje sa uložia do databázy sqlite3.

source: User login is created as last name with <x> prefix, meaning that if teachers last name is Johnson, his login is xJohnson. Password remains the same.
sk: Login užívateľa je vytvorený ako priezvisko s prefixom x, čiže ak je jeho priezvisko Kovac, login bude xKovac, heslo ostáva nezmenené.

source: How to create and assign the task
sk: Návod na vytvorenie úloh a priradenie úlohy

source: Follow steps in video tutorial.
sk: Postupujeme podľa priloženého videa.

source: In admin portal, obly teacher is able to create a batch of tasks.
sk: V admin portáli učiteľ vytvorí sadu úloh.

source: From this batch are tasks generated automatically.
sk: Zo sady sa automaticky vygenerujú jednotlivé úlohy.

source: By creating new TaskSubmission teacher can assign the assignment to student.
sk: Pomocou vytvorenia novej inštancie TaskSubmission/Pridelená úloha učiteľ priradí úlohu žiakovi.

source: How to create a student
sk: Návod na vytvorenie žiaka

source: Only teacher is able to create students.
sk: Vytvoriť žiaka môže iba učiteľ.

source: In admin portal, in the main section, selecting Add user teacher can create new student by filling the necessary fields.
sk: V admin portáli sa v hlavnej sekcií vyberie Users/Používatelia, klikne sa na Pridať používateľ a pokračuje sa vo vypĺňaní.

source: By clicking the Save button student is created and stored in the SQLite3 database.
sk: Po kliknutí na Save/Uložiť button sa žiak vytvorí a uloží do databázy.

source: Students username is automatically created with <x> prefix (for example if students last name is Mrkvicka, his login is xMrkvicka.
sk: Žiakov login je takisto priezvisko s prefixom x, čiže ak sa žiak volá Mrkvicka, jeho login je xMrkvicka.

source: How can student solve the assignment
sk: Návod na vypracovanie úloh žiaka

source: After student is signed in, table containing available batches is shown. Student can generate task after clicking on the Generate button, in batch table.
sk: Žiak sa prihlási do svojho účtu, čím sa mu zobrazí tabuľka z dostupnými sadami úloh. Študent si môže vygenerovať úlohu po kliknutí na tlačidlo Vygenerovať.

source: Another table on this subpage is containing tasks submitted the student. If the task was solved by student, points for this task is shown. If task was not solved, Solve button is shown.
sk: V ďalšej tabuľke na tejto podstránke sú zobrazené priradené úlohy. Pokiaľ riešenie úlohy bolo odovzdané študentom, sú zobrazené body získané za túto úlohu. Pokiaľ úloha nebola vyriešená, je zobrazené tlačidlo Vyriešiť.

source: After clicking Solve button, modal with task and mathematic editor is opened.
sk: Kliknutím na tlačidlo Vyriešiť sa vygeneruje modal so znením úlohy a matematický editor.

source: After clicking on Submit button, solution is automatically sended and evaluated.
sk: Odoslanie a vyhodnotenie výsledku sa realizuje okamžite stlačením tlačidla Odovzdať.

source: Download as PDF
sk: Stiahnuť ako PDF

source: Available batches
sk: Dostupné sady

source: Points for batch
sk: Body za sadu

source: GENERATE
sk: VYGENEROVAŤ

source: No batches available.
sk: Žiadne dostupné sady.

source: Assigned tasks
sk: Priradené úlohy

source: Task ID
sk: ID úlohy

source: Task
sk: Úloha

source: Batch
sk: Sada

source: SOLVE
sk: VYRIEŠIŤ

source: Point/s
sk: Bod/y

source: No tasks assigned.
sk: Žiadne priradené úlohy

source: Task assignment
sk: Znenie úlohy

source: Your solution
sk: Riešenie

source: Submit
sk: Odovzdať

source: See Profile
sk: Profil

source: Personal information
sk: Osobné údaje

source: Permissions
sk: Oprávnenia

source: Important dates
sk: Dôležité dátumy

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
sk: Z bezpečnostných dôvodov zadajte svoje staré heslo a potom dvakrát zadajte nové heslo, aby sme mohli overiť, či ste ho zadali správne.

source: First, enter a username and password. Then, you'll be able to edit more user options.
sk: Najprv zadajte používateľské meno a heslo. Potom budete môcť upraviť ďalšie používateľské možnosti.

source: Enter a username and password.
sk: Zadajte používateľské meno a heslo.

source: Please correct the error below.
sk: Opravte chybu nižšie.

source: Please correct the errors below.
sk: Opravte chyby nižšie.
